performance-testing/artillery.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://ec2-54-227-182-169.compute-1.amazonaws.com:8008
  phases:
    - duration: 20
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 60
      arrivalRate: 15
      rampTo: 50
      name: Spike
scenarios:
  - flow:
    - get:
        url: "/"